---
type: FloorType
namespace: Autodesk.Revit.DB
version: 2024
members: 4
tags: [revit-api, class]
---

# FloorType

`Autodesk.Revit.DB.FloorType` · Revit 2024 · 4 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Property | IsFoundationSlab | — | `public bool IsFoundationSlab { get ; }` |
| Property | Parameter | — | `` |
| Property | StructuralMaterialId | 2014 | `public ElementId StructuralMaterialId { get ; set ; }` |
| Property | ThermalProperties | 2013 | `public ThermalProperties ThermalProperties { get ; }` |